rahulsinghk998/BLE-1.3.2/CC254x Peripherals_Software_Examples/IAR_EW8051_8_11_CC254-3-4-5-Update/ioCC2545.h
#define RFRXFLEN       XREG(0x61C8)
#define RFRXFTHRS      XREG(0x61C9)
#define RFRXFWR        XREG(0x61CA)
#define RFRXFRD        XREG(0x61CB)
#define RFRXFWP        XREG(0x61CC)
#define RFRXFRP        XREG(0x61CD)
#define RFRXFSWP       XREG(0x61CE)
#define RFRXFSRP       XREG(0x61CF)
#define RFTXFLEN       XREG(0x61D0)
#define RFTXFTHRS      XREG(0x61D1)
#define RFTXFWR        XREG(0x61D2)
#define RFTXFRD        XREG(0x61D3)
#define RFTXFWP        XREG(0x61D4)
#define RFTXFRP        XREG(0x61D5)
#define RFTXFSWP       XREG(0x61D6)
#define RFTXFSRP       XREG(0x61D7)

/* Bit Stream Processor Registers */
#define BSP_P0         XREG(0x61E0)
#define BSP_P1         XREG(0x61E1)
#define BSP_P2         XREG(0x61E2)
#define BSP_P3         XREG(0x61E3)
#define BSP_D0         XREG(0x61E4)
#define BSP_D1         XREG(0x61E5)
#define BSP_D2         XREG(0x61E6)
#define BSP_D3         XREG(0x61E7)
#define BSP_W          XREG(0x61E8)
#define BSP_MODE       XREG(0x61E9)
#define BSP_DATA       XREG(0x61EA)

#define SW4            XREG(0x61F8)
#define SW5            XREG(0x61F9)
#define SW6            XREG(0x61FA)
#define SW7            XREG(0x61FB)
#define DC_I_L         XREG(0x61FC)
#define DC_I_H         XREG(0x61FD)
#define DC_Q_L         XREG(0x61FE)
#define DC_Q_H         XREG(0x61FF)


/* ------------------------------------------------------------------------------------------------
 *                                       Xdata Registers
 * ------------------------------------------------------------------------------------------------
 */
/* Observability Control */
#define OBSSEL0         XREG( 0x6243 )
#define OBSSEL1         XREG( 0x6244 )
#define OBSSEL2         XREG( 0x6245 )
#define OBSSEL3         XREG( 0x6246 )
#define OBSSEL4         XREG( 0x6247 )
#define OBSSEL5         XREG( 0x6248 )
#define TR0             XREG( 0x624B )

/* Power Management */
#define SRCRC           XREG( 0x6262 )

/* Chip Identification */
#define CHVER           XREG( 0x6249 )
#define CHIPID          XREG( 0x624A )

/* Debug Interface DMA Write to Flash */
#define DBGDATA         XREG( 0x6260 )

/*  Analog control register */
#define IVCTRL          XREG( 0x6265 )

/* Flash Controller */
#define FCTL            XREG( 0x6270 )
#define FADDRL          XREG( 0x6271 )
#define FADDRH          XREG( 0x6272 )
#define FWDATA          XREG( 0x6273 )
#define _XREG6274       XREG( 0x6274 )
#define _XREG6275       XREG( 0x6275 )

/* Chip Information */
#define CHIPINFO0       XREG( 0x6276 )
#define CHIPINFO1       XREG( 0x6277 )

/* IR Generation Control */
#define IRCTL           XREG( 0x6281 )

/* Clock Loss Detector */
#define CLD             XREG( 0x6290 )

/* Timer 1 Channels (only mapped as XREG) */
#define T1CCTL3         XREG( 0x62A3 )
#define T1CCTL4         XREG( 0x62A4 )
#define T1CC3L          XREG( 0x62AC )
#define T1CC3H          XREG( 0x62AD )
#define T1CC4L          XREG( 0x62AE )
#define T1CC4H          XREG( 0x62AF )
/* Definition which includes channels represented in SFR (additional XREG mapping of SFR) */
#define XX_T1CCTL0      XREG( 0x62A0 )
#define XX_T1CCTL1      XREG( 0x62A1 )
#define XX_T1CCTL2      XREG( 0x62A2 )
#define XX_T1CCTL3      XREG( 0x62A3 )
#define XX_T1CCTL4      XREG( 0x62A4 )
#define XX_T1CC0L       XREG( 0x62A6 )
#define XX_T1CC0H       XREG( 0x62A7 )
#define XX_T1CC1L       XREG( 0x62A8 )
#define XX_T1CC1H       XREG( 0x62A9 )
#define XX_T1CC2L       XREG( 0x62AA )
#define XX_T1CC2H       XREG( 0x62AB )
#define XX_T1CC3L       XREG( 0x62AC )
#define XX_T1CC3H       XREG( 0x62AD )
#define XX_T1CC4L       XREG( 0x62AE )
#define XX_T1CC4H       XREG( 0x62AF )
/* Pointers for array access */
#define P_T1CCTL        PXREG( 0x62A0 )
#define P_T1CC          PXREG( 0x62A6 )

/* Sleep Timer Capture Control */
#define STCC            XREG( 0x62B0 )
#define STCS            XREG( 0x62B1 )
#define STCV0           XREG( 0x62B2 )
#define STCV1           XREG( 0x62B3 )
#define STCV2           XREG( 0x62B4 )

/* Analog Comparator Control */
#define CMPCTL          XREG( 0x62D0 )

/* I2C */
#define I2CCFG          XREG( 0x6230 )
#define I2CCON          XREG( 0x6230 )   /* Old name for I2CCFG register (kept for backward compatibility) */
#define I2CSTAT         XREG( 0x6231 )
#define I2CSTA          XREG( 0x6231 )   /* Old name for I2CSTAT register (kept for backward compatibility) */
#define I2CDATA         XREG( 0x6232 )
#define I2CDAT          XREG( 0x6232 )   /* Old name for I2CDATA register (kept for backward compatibility) */
#define I2CADDR         XREG( 0x6233 )
#define I2CADR          XREG( 0x6233 )   /* Old name for I2CADDR register (kept for backward compatibility) */


/* Other */
#define IVCTRL          XREG( 0x6265 )

/* ------------------------------------------------------------------------------------------------
 *                                      Xdata Mapped SFRs
 * ------------------------------------------------------------------------------------------------
 */

/*
 *   Most SFRs are also accessible through XDATA address space.  The register definitions for
 *   this type of access are listed below.  The register names are identical to the SFR names
 *   but with the prefix X_ to denote an XDATA register.
 *
 *   Some SFRs are not accessible through XDATA space.  For clarity, entries are included for these
 *   registers.  They have a prefix of _NA to denote "not available."
 *
 *   For register descriptions, refer to the actual SFR declartions elsewhere in this file.
 */

#define X_P0        XREG( 0x7080 )   /*  Port 0. NOTE! Read-only access from XREG.          */
#define _NA_SP      XREG( 0x7081 )
#define _NA_DPL0    XREG( 0x7082 )
#define _NA_DPH0    XREG( 0x7083 )
#define _NA_DPL1    XREG( 0x7084 )
#define _NA_DPH1    XREG( 0x7085 )
#define X_U0CSR     XREG( 0x7086 )   /*  USART 0 Control and Status                         */
#define _NA_PCON    XREG( 0x7087 )

#define _NA_TCON    XREG( 0x7088 )
#define X_P0IFG     XREG( 0x7089 )   /*  Port 0 Interrupt Status Flag                       */
#define X_P1IFG     XREG( 0x708A )   /*  Port 1 Interrupt Status Flag                       */
#define X_P2IFG     XREG( 0x708B )   /*  Port 2 Interrupt Status Flag                       */
#define X_PICTL     XREG( 0x708C )   /*  Port Interrupt Control                             */
#define X_P1IEN     XREG( 0x708D )   /*  Port 1 Interrupt Mask                              */
#define _NA_SFR8E   XREG( 0x708E )
#define X_P0INP     XREG( 0x708F )   /*  Port 0 Input Mode                                  */

